#### Terraform Format and Style `success`
#### Terraform Initialization `success`
#### Terraform Validation `success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Terraform Plan `success`

<details><summary>Show Plan</summary>

```

module.demo.aws_iam_role.role: Refreshing state... [id=cq_backup_role]
module.demo.aws_kms_key.backup_kms_key: Refreshing state... [id=af4ebad9-f150-4828-87b8-cc4ca26d9f81]
module.demo.aws_backup_vault.backup_vault: Refreshing state... [id=cq_backup_vault]
module.demo.aws_backup_plan.plan: Refreshing state... [id=ccbb2b8d-de01-4e37-8661-2b73d8975f49]
module.demo.aws_backup_selection.selection: Refreshing state... [id=ebbf0967-c653-4ed3-a27d-58720e75a674]

Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.demo.aws_backup_plan.plan has changed
  ~ resource "aws_backup_plan" "plan" {
        id       = "ccbb2b8d-de01-4e37-8661-2b73d8975f49"
        name     = "cq_backup_plan"
      + tags     = {}
        # (3 unchanged attributes hidden)

      + rule {
          + completion_window        = 180
          + enable_continuous_backup = false
          + recovery_point_tags      = {}
          + rule_name                = "cq_backup_rule"
          + schedule                 = "cron(0 12 * * ? *)"
          + start_window             = 60
          + target_vault_name        = "cq_backup_vault"
        }
      - rule {
          - completion_window        = 180 -> null
          - enable_continuous_backup = false -> null
          - rule_name                = "cq_backup_rule" -> null
          - schedule                 = "cron(0 12 * * ? *)" -> null
          - start_window             = 60 -> null
          - target_vault_name        = "cq_backup_vault" -> null
        }
    }

  # module.demo.aws_backup_selection.selection has changed
  ~ resource "aws_backup_selection" "selection" {
        id            = "ebbf0967-c653-4ed3-a27d-58720e75a674"
        name          = "cq_backup_selection"
      + resources     = []
        # (3 unchanged attributes hidden)


        # (2 unchanged blocks hidden)
    }

  # module.demo.aws_backup_vault.backup_vault has changed
  ~ resource "aws_backup_vault" "backup_vault" {
        id              = "cq_backup_vault"
        name            = "cq_backup_vault"
      + tags            = {}
        # (4 unchanged attributes hidden)
    }

  # module.demo.aws_iam_role.role has changed
  ~ resource "aws_iam_role" "role" {
        id                    = "cq_backup_role"
        name                  = "cq_backup_role"
      + tags                  = {}
        # (9 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.demo.aws_kms_key.backup_kms_key has changed
  ~ resource "aws_kms_key" "backup_kms_key" {
        id                                 = "af4ebad9-f150-4828-87b8-cc4ca26d9f81"
      + tags                               = {}
        # (10 unchanged attributes hidden)
    }


Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
 <= read (data resources)

Terraform will perform the following actions:

  # module.demo.data.aws_iam_policy_document.document will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "document"  {
      + id        = (known after apply)
      + json      = (known after apply)
      + policy_id = "cq-backup-policy-document"

      + statement {
          + actions   = [
              + "SNS:Publish",
            ]
          + effect    = "Allow"
          + resources = [
              + (known after apply),
            ]
          + sid       = "__default_statement_ID"

          + principals {
              + identifiers = [
                  + "backup.amazonaws.com",
                ]
              + type        = "Service"
            }
        }
    }

  # module.demo.aws_backup_plan.plan will be updated in-place
  ~ resource "aws_backup_plan" "plan" {
        id       = "ccbb2b8d-de01-4e37-8661-2b73d8975f49"
        name     = "cq_backup_plan"
      ~ tags     = {
          + "key" = "backup_plan"
        }
      ~ tags_all = {
          + "key" = "backup_plan"
        }
        # (2 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.demo.aws_backup_vault.backup_vault will be updated in-place
  ~ resource "aws_backup_vault" "backup_vault" {
        id              = "cq_backup_vault"
        name            = "cq_backup_vault"
      ~ tags            = {
          + "key" = "backup_vault"
        }
      ~ tags_all        = {
          + "key" = "backup_vault"
        }
        # (3 unchanged attributes hidden)
    }

  # module.demo.aws_backup_vault_notifications.test will be created
  + resource "aws_backup_vault_notifications" "test" {
      + backup_vault_arn    = (known after apply)
      + backup_vault_events = [
          + "BACKUP_JOB_STARTED",
          + "RESTORE_JOB_COMPLETED",
        ]
      + backup_vault_name   = "cq_backup_vault"
      + id                  = (known after apply)
      + sns_topic_arn       = (known after apply)
    }

  # module.demo.aws_sns_topic.backup_sns_topic will be created
  + resource "aws_sns_topic" "backup_sns_topic" {
      + arn                         = (known after apply)
      + content_based_deduplication = false
      + fifo_topic                  = false
      + id                          = (known after apply)
      + name                        = "cq-backup-vault-events"
      + name_prefix                 = (known after apply)
      + owner                       = (known after apply)
      + policy                      = (known after apply)
      + tags_all                    = (known after apply)
    }

  # module.demo.aws_sns_topic_policy.test will be created
  + resource "aws_sns_topic_policy" "test" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + owner  = (known after apply)
      + policy = (known after apply)
    }

Plan: 3 to add, 2 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.binary

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.binary"

```

</details>

*Pusher: @irmatov, Action: `pull_request_target`, Working Directory: ``, Workflow: `terraform_plan`*